chore(README): update diagram
